# RibbonItem Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItem Class
Members See Also
---
The RibbonItem object represents an item on RibbonPanel, can be a push-button or a pull-down which should contain the information for creating one RibbonItem.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class RibbonItem
```

Visual Basic
---
```text
Public Class RibbonItem
```

Visual C++
---
```text
public ref class RibbonItem
```

# Remarks
This class is not supported in Revit Macros.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..RibbonItem Autodesk.Revit.UI..::..ComboBox Autodesk.Revit.UI..::..ComboBoxMember Autodesk.Revit.UI..::..RadioButtonGroup Autodesk.Revit.UI..::..RibbonButton Autodesk.Revit.UI..::..TextBox
# See Also
RibbonItem Members
Autodesk.Revit.UI Namespace